# Week 13 Quiz

## Chenxi Jiang - cj2706

### Due Tues Dec 13th, 11:59pm ET

In this quiz we'll practice using SQL to extract and transform some US State population data.

We'll use pandasql to execute SQL on pandas dataframes.

If for some reason pandasql deosn't work, please just take a shot at what you think the SQL should be.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from pandasql import PandaSQL

%matplotlib inline

## Set up pysqldf

In [2]:
# Setting up an instance of PandaSQL to pass SQL commands to
pysqldf = PandaSQL()

## Load Data

In [3]:
# Load state population data
state_population = pd.read_csv('../data/state-population.csv')
state_population = state_population.rename({'state/region':'abbreviation'},
                                           axis=1)

# Load state area data
state_areas = pd.read_csv('../data/state-areas.csv')
state_areas = state_areas.rename({'area (sq. mi)':'area'},axis=1)

# Load state abbreviation data
state_abbreviations = pd.read_csv('../data/state-abbrevs.csv')

## Practice SQL

In [4]:
# Write SQL to print out:
#    all columns from table state_areas limited to the first 3 rows 
#    aka state_areas.head(3)
sql = """
SELECT *
FROM state_areas
LIMIT 3
"""
pysqldf(sql)

     state    area
0  Alabama   52423
1   Alaska  656425
2  Arizona  114006

In [5]:
# Write SQL to print out the same dataframe as given by this pandas call:
#    state_population.loc[:,['abbreviation']].iloc[:3]
sql = """
SELECT abbreviation
FROM state_population
LIMIT 3
"""
pysqldf(sql)

  abbreviation
0           AL
1           AL
2           AL

---

# OPTIONAL

Everything below is optional if you'd like more practice with sql

In [6]:
# Write SQL to print out:
#    columns state and area from table state_areas for rows with state starting with 'Mi'
sql = """
SELECT state, area
FROM state_areas
WHERE state LIKE 'Mi%'
"""
pysqldf(sql)

         state   area
0     Michigan  96810
1    Minnesota  86943
2  Mississippi  48434
3     Missouri  69709

In [7]:
# Write SQL to print out:
#    columns state and area from table state_areas 
#    for rows with state starting with 'Mi' and area greater than 80000
sql = """
SELECT state, area
FROM state_areas
WHERE state LIKE 'Mi%' and area > 80000
"""
pysqldf(sql)

       state   area
0   Michigan  96810
1  Minnesota  86943

In [8]:
# Write SQL to print out:
#    all columns from table state_areas 
#    LEFT JOINed with state_abbreviations ON state
#    limited to the first 3 rows
sql = """
SELECT *
FROM state_areas
LEFT JOIN state_abbreviations
ON state_areas.state = state_abbreviations.state
LIMIT 3;
"""
pysqldf(sql)

     state    area    state abbreviation
0  Alabama   52423  Alabama           AL
1   Alaska  656425   Alaska           AK
2  Arizona  114006  Arizona           AZ

In [9]:
# Write SQL to print out:
#    all columns from table state_areas aliased as s_area
#    INNER JOINed with state_abbreviations aliased as s_abb ON state
#    INNER JOINed with state_population aliased as s_pop ON abbreviation
#    limited to the first 3 rows
sql = """
SELECT *
FROM state_areas as s_area
INNER JOIN state_abbreviations as s_abb
ON s_area.state = s_abb.state
INNER JOIN state_population as s_pop
ON s_abb.abbreviation = s_pop.abbreviation
LIMIT 3;
"""
pysqldf(sql)

     state   area    state abbreviation abbreviation   ages  year  population
0  Alabama  52423  Alabama           AL           AL  total  1990   4050055.0
1  Alabama  52423  Alabama           AL           AL  total  1991   4099156.0
2  Alabama  52423  Alabama           AL           AL  total  1992   4154014.0

In [10]:
# Write SQL to print out:
#    s_area.state,
#    s_area.area,
#    s_pop.year,
#    s_pop.population
#    from table state_areas aliased as s_area
#    INNER JOINed with state_abbreviations aliased as s_abb ON state
#    INNER JOINed with state_population aliased as s_pop ON abbreviation
#    where s_pop.ages is 'total'
#    ordered by s_area.state, s_pop.year
sql = """
SELECT s_area.state, s_area.area, s_pop.year, s_pop.population
From state_areas as s_area
INNER JOIN state_abbreviations as s_abb
On s_area.state = s_abb.state
INNER JOIN state_population as s_pop
ON s_abb.abbreviation = s_pop.abbreviation
where s_pop.ages = 'total'
ORDER BY s_area.state, s_pop.year

"""
pysqldf(sql)
# you should see 1224 rows and 4 columns

        state   area  year  population
0     Alabama  52423  1990   4050055.0
1     Alabama  52423  1991   4099156.0
2     Alabama  52423  1992   4154014.0
3     Alabama  52423  1993   4214202.0
4     Alabama  52423  1994   4260229.0
...       ...    ...   ...         ...
1219  Wyoming  97818  2009    559851.0
1220  Wyoming  97818  2010    564222.0
1221  Wyoming  97818  2011    567329.0
1222  Wyoming  97818  2012    576626.0
1223  Wyoming  97818  2013    582658.0

[1224 rows x 4 columns]

In [14]:
# Feel free to experiment with additional SQL calls. 
# For example, state_population contains more regions than there are states in state_areas
#     so different join types (left, right) will give different results

# As an additional challenge:
#  calculate the total average population per state in thousands over the years observed
sql = """
SELECT s_area.state, AVG(s_pop.population) as avg_popu
From state_areas as s_area
INNER JOIN state_abbreviations as s_abb
On s_area.state = s_abb.state
INNER JOIN state_population as s_pop
ON s_abb.abbreviation = s_pop.abbreviation
group by s_area.state




"""
pysqldf(sql)

                   state      avg_popu
0                Alabama  2.797862e+06
1                 Alaska  4.164389e+05
2                Arizona  3.337577e+06
3               Arkansas  1.686640e+06
4             California  2.170908e+07
5               Colorado  2.727803e+06
6            Connecticut  2.128442e+06
7               Delaware  4.979201e+05
8   District of Columbia  3.496533e+05
9                Florida  1.008313e+07
10               Georgia  5.285421e+06
11                Hawaii  7.781240e+05
12                 Idaho  8.576250e+05
13              Illinois  7.757703e+06
14               Indiana  3.838380e+06
15                  Iowa  1.831789e+06
16                Kansas  1.703569e+06
17              Kentucky  2.536397e+06
18             Louisiana  2.811572e+06
19                 Maine  7.906852e+05
20              Maryland  3.357502e+06
21         Massachusetts  3.891187e+06
22              Michigan  6.157709e+06
23             Minnesota  3.108525e+06
24           Mississippi  1.794283e+06
25              Missouri  3.522333e+06
26               Montana  5.716055e+05
27              Nebraska  1.087942e+06
28                Nevada  1.310279e+06
29         New Hampshire  7.675910e+05
30            New Jersey  5.227053e+06
31            New Mexico  1.175271e+06
32              New York  1.171282e+07
33        North Carolina  5.140725e+06
34          North Dakota  4.066764e+05
35                  Ohio  7.079279e+06
36              Oklahoma  2.192022e+06
37                Oregon  2.146920e+06
38          Pennsylvania  7.615765e+06
39          Rhode Island  6.390411e+05
40        South Carolina  2.569703e+06
41          South Dakota  4.840280e+05
42             Tennessee  3.579156e+06
43                 Texas  1.381758e+07
44                  Utah  1.536009e+06
45               Vermont  3.735618e+05
46              Virginia  4.494164e+06
47            Washington  3.747736e+06
48         West Virginia  1.114171e+06
49             Wisconsin  3.371227e+06
50               Wyoming  3.212865e+05